# St7SetInfluenceMultiVariableName

Sets the name of a multi-variable load influence combination case.

long St7SetInfluenceMultiVariableName(long uID, long MultiVariableCaseID,

char* MultiVariableName)

Input Parameters

uID

Strand7 model file ID.

MultiVariableCaseID

ID of the load influence multi-variable combination case.

MultiVariableName

Name of the load influence multi-variable combination case.

Strand7 API Manual